<a href="https://colab.research.google.com/github/VAMSHINEELAMMA/SAMSUNG-INNOVATION-CAMPUS/blob/main/ex_0204.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
my_index = ['a','b','c']
my_values = [222,333,444]
my_dict = {'a':222, 'b':333, 'c':444}
my_arr = np.array(my_values)

In [3]:
# Series with values.
pd.Series(my_values)

0    222
1    333
2    444
dtype: int64

In [4]:
# Series with values and index labels.
pd.Series(data=my_values, index=my_index)

a    222
b    333
c    444
dtype: int64

In [5]:
# Series from a NumPy array.
pd.Series(my_arr)

0    222
1    333
2    444
dtype: int64

In [6]:
# Series from a NumPy array with index labels.
pd.Series(my_arr, index=my_index)

a    222
b    333
c    444
dtype: int64

In [7]:
# Series from a dictionary.
pd.Series(my_dict)

a    222
b    333
c    444
dtype: int64

In [8]:
s = pd.Series(data=[111,222,333,444], index = ['a','b','c','d'], name='MySeries')
s

a    111
b    222
c    333
d    444
Name: MySeries, dtype: int64

In [9]:
s.index                                   # Index labels.

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
s.name                                    # Name attribute.

'MySeries'

In [11]:
s.dtype                                   # Data type.

dtype('int64')

In [12]:
s.values                                  # The values as NumPy array.

array([111, 222, 333, 444])

In [13]:
s[1]

/tmp/ipython-input-878419959.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[1]

np.int64(222)

In [14]:
s['a']

np.int64(111)

In [15]:
s[2:4]

c    333
d    444
Name: MySeries, dtype: int64

In [16]:
s[['a','d']]

a    111
d    444
Name: MySeries, dtype: int64

In [17]:
s1 = pd.Series(data=[1,2,3,4], index = ['d','b','c','a'])
s2 = pd.Series(data=[1,2,3,4], index = ['a','b','d','e'])

In [18]:
s1 + s2

a    5.0
b    4.0
c    NaN
d    4.0
e    NaN
dtype: float64

In [19]:
s1 - s2

a    3.0
b    0.0
c    NaN
d   -2.0
e    NaN
dtype: float64

In [20]:
s1 * s2

a    4.0
b    4.0
c    NaN
d    3.0
e    NaN
dtype: float64

In [21]:
s1/s2

a    4.000000
b    1.000000
c         NaN
d    0.333333
e         NaN
dtype: float64

In [22]:
2*s1

d    2
b    4
c    6
a    8
dtype: int64

In [23]:
s1.sum()

np.int64(10)

In [24]:
s1.mean()

np.float64(2.5)

In [25]:
s1.median()

2.5

In [26]:
s1.max()

4

In [27]:
s1.std()

1.2909944487358056

In [28]:
s1.sort_values()

d    1
b    2
c    3
a    4
dtype: int64

In [29]:
s1.sort_index()

a    4
b    2
c    3
d    1
dtype: int64

In [30]:
ser_height = pd.Series([165.3, 170.1, 175.0, 182.1, 168.0, 162.0, 155.2, 176.9, 178.5, 176.1, 167.1, 180.0, 162.2, 176.1, 158.2, 168.6, 169.2],name='height')
ser_height

0     165.3
1     170.1
2     175.0
3     182.1
4     168.0
5     162.0
6     155.2
7     176.9
8     178.5
9     176.1
10    167.1
11    180.0
12    162.2
13    176.1
14    158.2
15    168.6
16    169.2
Name: height, dtype: float64

In [31]:
ser_height.apply(lambda x: x/100)

0     1.653
1     1.701
2     1.750
3     1.821
4     1.680
5     1.620
6     1.552
7     1.769
8     1.785
9     1.761
10    1.671
11    1.800
12    1.622
13    1.761
14    1.582
15    1.686
16    1.692
Name: height, dtype: float64